#+title: Java Basics "Cheat Sheet"
#+DESCRIPTION: An org document of the basics of java in a "Quick Cheat Sheet".
#+author: Leonardo Noriega
#+date: <2022-11-17 Thu>

** Defining variables and storing values in variables
#+begin_src java
public class Main {
    public static void main(String[] args){
        String String1 = "Leonardo";
        int integrer1 = 12;
        float float1 = 7.25f;
        char character1 = 'a';
        Boolean boolean1 = true;
        //"Printing" all the stored values by calling the variables. Don't worry you will learn what this "printing" is.
        System.out.println(String1 + " " + integrer1 + " " + float1 + " " + character1 + " " + boolean1);
    }
}
#+end_src
#+RESULTS:
: Leonardo 12 7.25 a true

